## DataFrame İndeksler

## 1- yeni kolon ekleme

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = np.random.randn(4,3)

In [3]:
dataFrame = pd.DataFrame(data, index = ["Yiğit","Sercan","Reyhan","Şevki"], columns=["Yaş","iş","Maaş"])

In [4]:
dataFrame

             Yaş        iş      Maaş
Yiğit   0.728124 -1.915883  1.011296
Sercan -0.007990  1.654855  0.836080
Reyhan -0.412708 -0.512368 -0.492226
Şevki   0.801277 -0.843425  0.090236

In [5]:
dataFrame["Emeklilik"] = dataFrame["Yaş"] + dataFrame["Yaş"] # aynı iki column birbirine eklendi

In [6]:
dataFrame

             Yaş        iş      Maaş  Emeklilik
Yiğit   0.728124 -1.915883  1.011296   1.456247
Sercan -0.007990  1.654855  0.836080  -0.015979
Reyhan -0.412708 -0.512368 -0.492226  -0.825416
Şevki   0.801277 -0.843425  0.090236   1.602555

In [7]:
dataFrame["iş"]

Yiğit    -1.915883
Sercan    1.654855
Reyhan   -0.512368
Şevki    -0.843425
Name: iş, dtype: float64

## DROP- bir columnu düşürebiliriz dataFrame.drop()

In [10]:
dataFrame.drop("Emeklilik", axis = 1) 
# axis = 1 sütunları ifade eder

             Yaş        iş      Maaş
Yiğit   0.728124 -1.915883  1.011296
Sercan -0.007990  1.654855  0.836080
Reyhan -0.412708 -0.512368 -0.492226
Şevki   0.801277 -0.843425  0.090236

In [13]:
dataFrame.drop("Şevki", axis = 0)
# axis = 0 satırları ifade eder

             Yaş        iş      Maaş  Emeklilik
Yiğit   0.728124 -1.915883  1.011296   1.456247
Sercan -0.007990  1.654855  0.836080  -0.015979
Reyhan -0.412708 -0.512368 -0.492226  -0.825416

In [14]:
dataFrame

             Yaş        iş      Maaş  Emeklilik
Yiğit   0.728124 -1.915883  1.011296   1.456247
Sercan -0.007990  1.654855  0.836080  -0.015979
Reyhan -0.412708 -0.512368 -0.492226  -0.825416
Şevki   0.801277 -0.843425  0.090236   1.602555

## dataFrame.drop("Emeklilik", axis = 1 , inplace = True ya da inplace = False)

In [15]:
# Sadece drop yaparak dataframe değişmez

In [16]:
# Bu nedenle inplace= True yaparak bu değişikleri uygulayabiliriz.
# Default değer ise inplace = False dur

In [19]:
dataFrame.drop("Emeklilik", axis = 1, inplace = True)

In [21]:
dataFrame
# Artık kalıcı olarak silindi

             Yaş        iş      Maaş
Yiğit   0.728124 -1.915883  1.011296
Sercan -0.007990  1.654855  0.836080
Reyhan -0.412708 -0.512368 -0.492226
Şevki   0.801277 -0.843425  0.090236

## İndekslerin spesifik değerlerini getirme

In [23]:
dataFrame.loc["Yiğit"]["Yaş"] # bu şekilde istenien değeri çağırmak mümkün

0.7281235613825191

In [24]:
dataFrame.loc["Reyhan"]["Maaş"]

-0.492225573364708

In [25]:
dataFrame< 0

          Yaş     iş   Maaş
Yiğit   False   True  False
Sercan   True  False  False
Reyhan   True   True   True
Şevki   False   True  False

In [27]:
dataFrame[dataFrame["Yaş"]>0] # Sadece Yaşı 0 dan büyük olanları verir bu şekilde

            Yaş        iş      Maaş
Yiğit  0.728124 -1.915883  1.011296
Şevki  0.801277 -0.843425  0.090236

In [30]:
dataFrame[dataFrame["iş"]>0]

            Yaş        iş     Maaş
Sercan -0.00799  1.654855  0.83608